Hello Lauren,

thank you for raising the issue!

Based on the details you provided I tried to reproduce the issue. Below is the code I used for this.
The Terraform binary version is  v1.1.3 and the provider version v5.0.0.

```hcl
terraform {
  required_providers {
    aws = {
      source  = "hashicorp/aws"
      version = "5.0.0"
    }
  }
  required_version = "1.1.3"
}

resource "aws_wafv2_web_acl" "admin_alb_acl" {
  name        = "admin-acl"
  description = "Admin WAF ACL"
  scope       = "REGIONAL"
  tags = {
    Name = "admin-acl"
    owner ="stefan.freitag@foo.bar"
  }
  default_action {
    block {}
  }
  visibility_config {
    cloudwatch_metrics_enabled = true
    metric_name                = "admin-acl"
    sampled_requests_enabled   = true
  }
}
```

The first apply run created the web acl successfully:

```shell
❯ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_wafv2_web_acl.admin_alb_acl will be created
  + resource "aws_wafv2_web_acl" "admin_alb_acl" {
      + arn         = (known after apply)
      + capacity    = (known after apply)
      + description = "Admin WAF ACL"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "admin-acl"
      + scope       = "REGIONAL"
      + tags        = {
          + "Name"  = "admin-acl"
          + "owner" = "stefan.freitag@foo.bar"
        }
      + tags_all    = {
          + "Name"  = "admin-acl"
          + "owner" = "stefan.freitag@foo.bar"
        }

      + default_action {

          + block {
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "admin-acl"
          + sampled_requests_enabled   = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_wafv2_web_acl.admin_alb_acl: Creating...
aws_wafv2_web_acl.admin_alb_acl: Creation complete after 1s [id=092467c5-693f-49a7-9e6d-a68280232279]
```


The value of the owner tag was updated. The second apply was executed without running into the issue you described.

```shell
❯ terraform apply
aws_wafv2_web_acl.admin_alb_acl: Refreshing state... [id=092467c5-693f-49a7-9e6d-a68280232279]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # aws_wafv2_web_acl.admin_alb_acl has changed
  ~ resource "aws_wafv2_web_acl" "admin_alb_acl" {
        id            = "092467c5-693f-49a7-9e6d-a68280232279"
        name          = "admin-acl"
        tags          = {
            "Name"  = "admin-acl"
            "owner" = "stefan.freitag@foo.bar"
        }
      + token_domains = []
        # (6 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to undo or respond to these changes.

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_wafv2_web_acl.admin_alb_acl will be updated in-place
  ~ resource "aws_wafv2_web_acl" "admin_alb_acl" {
        id            = "092467c5-693f-49a7-9e6d-a68280232279"
        name          = "admin-acl"
      ~ tags          = {
          ~ "owner" = "stefan.freitag@foo.bar" -> "stefan.freitag@foo.com"
            # (1 unchanged element hidden)
        }
      ~ tags_all      = {
          ~ "owner" = "stefan.freitag@foo.bar" -> "stefan.freitag@foo.com"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_wafv2_web_acl.admin_alb_acl: Modifying... [id=092467c5-693f-49a7-9e6d-a68280232279]
aws_wafv2_web_acl.admin_alb_acl: Modifications complete after 1s [id=092467c5-693f-49a7-9e6d-a68280232279]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
```

Could you please provide e.g the logs from your Terraform runs? [This link](https://developer.hashicorp.com/terraform/internals/debugging) provides details on the `TF_LOG` variable which is handy for this task. Feel also free to provide feedback on my code/ steps. Maybe I missed important points.
